---
kind: enumMember
id: F:Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.MissingParent
enum: Autodesk.Revit.DB.KeyBasedTreeEntryErrorType
source: html/92f21b30-036d-9fa8-0662-b5d0e7c474de.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.MissingParent

The parent specified for a entry does not exist in the KeyBasedTreeEntires object.